<?php

namespace Faker\Provider\el_GR;

class Company extends \Faker\Provider\Company
{
    protected static $companySuffix = [
        'Ο.Ε',
        'Ε.Ε',
        'Α.Ε',
        'Ε.Π.Ε',
    ];

    protected static $companyFormats = [
        '{{lastName}} {{firstName}} {{companySuffix}}',
        '{{lastName}}-{{firstName}}',
    ];

    protected static $grafm = ['#########'];

    protected static $doy = [
        'Α\' Αθήνας',
        'Β\' Αθήνας',
        'Γ\' Αθήνας',
        'ΣΤ\' Αθήνας',
        'Γαλάτσιου',
        'Α\' Πειραιά',
        'Β\' Πειραιά',
        'Γ\' Πειραιά',
        'Α\' Θεσσαλονίκης',
        'Β\' Θεσσαλονίκης',
        'Γλυφάδας',
        'Ωροπού',
        'Καλιθέας',
        'Αγίου Δημητρίου',
        'Νέας Σμύρνης',
        'Αμαρουσίου',
        'Θήρας',
        'Αμοργού',
        'Πατρών',
        'ΔΟΥ ΠΛΟΙΩΝ',
        'ΦΑΕΕ ΑΘΗΝΩΝ',
    ];

    protected static $object = [
        'Αγρότης',
        'Αρχαιολόγος',
        'Αρχιτέκτονας',
        'Βιβλιοθηκονόμος',
        'Γιατρός',
        'Γραφίστας',
        'Δασοφύλακας',
        'Δημοσιογράφος',
        'Δικηγόρος',
        'Εισαγωγές Εξαγωγές',
        'Εκπαιδευτικός',
        'Εκτελωνιστής',
        'Έμπορος',
        'Επικοινωνιολόγος',
        'Επιστήμονας',
        'Επιχειρηματίας',
        'Ηθοποιός',
        'Ηλεκτρονικός',
        'Ηχολήπτης',
        'Καλλιτεχνικός Πράκτορας',
        'Καραγκιοζοπαίχτης',
        'Καρεκλοποιός',
        'Κλόουν',
        'Κομμωτής',
        'Κομπάρσος',
        'Κουλουράς',
        'Κτηνοτρόφος',
        'Λογιστής',
        'Μάγειρας',
        'Μελισσοκόμος',
        'Μεσίτης',
        'Μεταφορέας',
        'Μεταφραστής',
        'Μηχανικός',
        'Μηχανολόγος Μηχανικός',
        'Μοντέλο',
        'Μουσικός',
        'Μπαρίστας',
        'Μυστικός Πράκτορας',
        'Νοσοκόμος',
        'Νυχτοφύλακας',
        'Ξεναγός',
        'Ξυλουργός',
        'Οδοκαθαριστής',
        'Οικονομολόγος',
        'Περιβαλλοντολόγος',
        'Προγραμματιστής',
        'Πωλητής',
        'Ραδιοφωνικός Παραγωγός',
        'Ράφτης',
        'Σπηλαιολόγος',
        'Συγγραφέας',
        'Σύμβουλος',
        'Ταχυδρόμος',
        'Τεχνικός Ασφαλείας',
        'Τηλεοπτικός Παρουσιαστής',
        'Τραγουδιστής',
        'Υπηρεσίες Διαδικτύου',
        'Φανοποιός',
        'Φωτογράφος',
        'Χημικός Μηχανικός',
        'Χορευτής',
        'Χρηματοοικονομικός Αναλυτής',
        'Ωρολογοποιός',
    ];

    /**
     * @example 'Αθήνας'
     */
    public static function doy()
    {
        return static::randomElement(static::$doy);
    }

    /**
     * Return The profession of a company
     *
     * @example 'Δημοσιογράφος'
     */
    public static function object()
    {
        return static::randomElement(static::$object);
    }
}
